clc
solve('x^2-(exp((s*(r-r*x))))=0','x')
solve('x^2-(exp((-(2*512/10^9+512/10^9))*(r-r*x)))=0','x')


s=(-(2*512/10^9+512/10^9))  %s=-(M*t_1+t_2)
%r=0.2*10^9/512   arrival rate



format long 


root=[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 ];%用于存储z_m的根。
i=1;
rou=0.05;
while (rou<0.71)
    root(i)=(-(3906250*lambertw(0, (3*(rou*10^9/512)*exp(-(3*(rou*10^9/512))/1953125)^(1/2))/3906250))/(3*(rou*10^9/512)));
    
    rou=rou+0.05;
    i=i+1;
end
root

i=1;
while (i<14)
    a=exp(-(512*10^(-9)*(i*0.05*10^9/512-(i*0.05*10^9/512)*root(i))));
    b=exp(-512*10^(-9)*(i*0.05*10^9/512-(i*0.05*10^9/512)*root(i)));
    mat1=sym([2,1;((root(i))^2*(a^0)-a^2*(root(i))^0),(root(i))^2*a-a^2*root(i)]);
    mat2=sym([(2-(0.05*i*10^9/512)*(512/10^9)/(1-0.05*i));0]);
    hmat=eval(mat1\mat2) %即方程组的解。
    i=i+1;
    root(i);  
end
